[
  {
    "songName": "The Power (Choral Version)",
    "feel": "Triumphant and rousing, instilling courage and determination.",
    "instrumentsUsed": "Mighty choir, pounding drums, and brass fanfare",
    "situationUsedInGame": "Plays during the final battle and other climactic moments.",
    "youTubeLink": "https://www.youtube.com/watch?v=0U-wHyT1zbM"
  },
  {
    "songName": "I Want To Live (Instrumental Version)",
    "feel": "Emotional and hopeful, with an undercurrent of sorrow.",
    "instrumentsUsed": "Piano lead with strings and French horn harmonies",
    "situationUsedInGame": "Often heard in camp during quiet moments (Act 3) and at a key story vista.",
    "youTubeLink": "https://www.youtube.com/watch?v=bNWyj6nCs8Q"
  },
  {
    "songName": "Last Light",
    "feel": "Warm and hopeful, giving a sense of refuge amidst darkness.",
    "instrumentsUsed": "Gentle strings, soft woodwinds, and subtle choral humming",
    "situationUsedInGame": "Plays at the Last Light Inn, a safe haven in the shadow-cursed lands (Act 2).",
    "youTubeLink": "https://www.youtube.com/watch?v=eJQJPwQDF-k"
  },
  {
    "songName": "Nine Blades",
    "feel": "Energetic and tense, driving the excitement of battle.",
    "instrumentsUsed": "Fast-paced strings, pounding percussion, and horn blasts",
    "situationUsedInGame": "Used during intense combat, notably the goblin ambush when Wyll joins in Act 1.",
    "youTubeLink": "https://www.youtube.com/watch?v=OMeK3A1Fo6U"
  },
  {
    "songName": "Sixteen Strikes",
    "feel": "Fierce and adrenaline-pumping, escalating the battle's intensity.",
    "instrumentsUsed": "Aggressive percussion, sharp strings, and choral accents",
    "situationUsedInGame": "A high-intensity combat piece that kicks in after critical hits or big moments in fights.",
    "youTubeLink": "https://www.youtube.com/watch?v=5kJkAoaW634"
  },
  {
    "songName": "The Grand Design (Requiem)",
    "feel": "Grave and monumental, building a sense of finality and awe.",
    "instrumentsUsed": "Slow-building orchestra with ominous choir and booming drums",
    "situationUsedInGame": "Heard during the final confrontation with the Netherbrain and endgame sequences.",
    "youTubeLink": "https://www.youtube.com/watch?v=qqKscHtqdfw"
  },
  {
    "songName": "Mind Flayer Theme",
    "feel": "Alien and foreboding, evoking cosmic horror and suspense.",
    "instrumentsUsed": "Brooding low strings, dissonant tones, and eerie choral effects",
    "situationUsedInGame": "Used in the prologue (Nautiloid invasion) and scenes involving Mind Flayers.",
    "youTubeLink": "https://www.youtube.com/watch?v=ErSwDczBYD0"
  }
]

