[
  {
    "songName": "Main Theme",
    "feel": "Bold and heroic, capturing a sense of grand adventure.",
    "instrumentsUsed": "Full symphonic orchestra with triumphant brass, sweeping strings, and driving percussion.",
    "situationUsedInGame": "Title sequence and main leitmotif throughout the game.",
    "youTubeLink": "https://www.youtube.com/watch?v=Fi_D97cHcbQ"
  },
  {
    "songName": "Wind Scene",
    "feel": "Peaceful and nostalgic, evoking a gentle stroll through a serene landscape.",
    "instrumentsUsed": "Woodwinds carrying the melody, supported by warm strings and soft harp or piano.",
    "situationUsedInGame": "Overworld theme for 600 A.D., providing calm background during exploration.",
    "youTubeLink": "https://youtu.be/pUFELL5hHbg?si=pT7fIvhoBOEdo9WH"
  },
  {
    "songName": "Secret of the Forest",
    "feel": "Calm yet mysterious with a dreamy, hypnotic ambience.",
    "instrumentsUsed": "Harp or piano arpeggios with soft strings and woodwind solos.",
    "situationUsedInGame": "Played in forest areas during nighttime exploration.",
    "youTubeLink": "https://youtu.be/WGXDgFLTro0?si=HnHfQQsprtBQnDzM"
  },
  {
    "songName": "Frog’s Theme",
    "feel": "Heroic and noble with a touch of sorrow, capturing knightly valor.",
    "instrumentsUsed": "Flute-led melody with trumpet fanfares, snare drums, and supporting strings.",
    "situationUsedInGame": "Frog’s personal theme during his heroic entrances and key character moments.",
    "youTubeLink": "https://youtu.be/9vUtM9iySqg?si=O70PZLNErK-QGyUK"
  },
  {
    "songName": "Battle with Magus (Magus’s Theme)",
    "feel": "Dark and foreboding, intensifying the ominous atmosphere of the battle.",
    "instrumentsUsed": "Deep brass, pounding percussion, urgent strings, and low organ-like tones.",
    "situationUsedInGame": "Boss battle against Magus in his castle.",
    "youTubeLink": "https://youtu.be/Kfegbe-B8Ek?si=zf41ZmKtTs_wn01-"
  },
  {
    "songName": "Corridors of Time",
    "feel": "Dreamy and mystical, evoking wonder and ancient magic.",
    "instrumentsUsed": "Sitar-like sounds, delicate bells or chimes, strings, and gentle percussion.",
    "situationUsedInGame": "Overworld theme for Kingdom of Zeal, enhancing the magical atmosphere.",
    "youTubeLink": "https://www.youtube.com/watch?v=BH0E76oozIc"
  },
  {
    "songName": "Schala’s Theme",
    "feel": "Haunting and gentle, evoking bittersweet emotion and melancholy.",
    "instrumentsUsed": "Soft bell-like piano or celesta with warm strings and subtle woodwinds.",
    "situationUsedInGame": "Played during emotional scenes involving Schala, emphasizing her tragic beauty.",
    "youTubeLink": "https://youtu.be/wGU9fJoSRb0?si=w81UfijhX_Ki5zKL"
  },
  {
    "songName": "At the Bottom of Night",
    "feel": "Melancholy and deeply emotional, conveying loss and reflective sorrow.",
    "instrumentsUsed": "Tender piano or acoustic guitar with expressive strings and soft percussion.",
    "situationUsedInGame": "Accompanies sad, poignant moments and campfire scenes.",
    "youTubeLink": "https://youtu.be/pABDy9tzz1k?si=F-PSwQ2LD6E1IeTX"
  },
  {
    "songName": "To Far Away Times",
    "feel": "Gentle, bittersweet, and hopeful, providing a calm sense of closure.",
    "instrumentsUsed": "Soft piano or harp with lush strings, occasional woodwind accents, and subtle horns.",
    "situationUsedInGame": "Ending/credits theme, underscoring the farewell to the adventure.",
    "youTubeLink": "https://youtu.be/GzjHvtdYUHE?si=ieEQhMbQb5WWuC6E"
  },
  {
    "songName": "Memories of Green",
    "feel": "Serene and reflective, with a blend of calmness and wistful longing.",
    "instrumentsUsed": "Solo piano with gentle strings and occasional woodwind embellishments.",
    "situationUsedInGame": "Overworld theme for 1000 A.D., evoking peaceful exploration of Guardia.",
    "youTubeLink": "https://youtu.be/NZr0wag1pyA?si=EBPgBcUa9sdYmObo"
  }
]

