[
  {
    "songName": "Journey of a Lifetime ~ Frieren Main Theme",
    "feel": "Grand and whimsical, evoking a sense of adventure and wonder.",
    "instrumentsUsed": "Sweeping orchestral strings and bold brass with Celtic-style woodwind flourishes.",
    "situationUsedInGame": "Main theme music used during sweeping travel montages and adventurous scenes.",
    "youTubeLink": "https://www.youtube.com/watch?v=Fgqb-sA6y-I"
  },
  {
    "songName": "Frieren the Slayer",
    "feel": "Intense and epic, conveying heroic determination in battle.",
    "instrumentsUsed": "Powerful choral vocals, driving strings, and triumphant trumpets with heavy percussion.",
    "situationUsedInGame": "Plays during climactic battle scenes when Frieren unleashes her full power.",
    "youTubeLink": "https://www.youtube.com/watch?v=WQkhnichGlw"
  },
  {
    "songName": "Farewell, My Friend",
    "feel": "Somber and mournful, expressing deep sorrow and reverence.",
    "instrumentsUsed": "Ethereal choir and gentle string sections in a funeral-like arrangement.",
    "situationUsedInGame": "Heard in emotional farewell moments, notably during Himmel's funeral scene.",
    "youTubeLink": "https://www.youtube.com/watch?v=XB1fUzKdew8"
  },
  {
    "songName": "Zoltraak",
    "feel": "Dark and ominous, building a sense of overwhelming magical power.",
    "instrumentsUsed": "Dramatic chanting choir, thunderous drums, and resonant brass tones.",
    "situationUsedInGame": "Used in high-tension magic battles, such as when the ultimate spell \"Zoltraak\" is cast.",
    "youTubeLink": "https://www.youtube.com/watch?v=M7gm_r8hXoU"
  },
  {
    "songName": "For 1000 Years",
    "feel": "Wistful and reflective, yet quietly hopeful over the passage of time.",
    "instrumentsUsed": "Melodic strings and woodwinds with gentle piano, swelling into a full orchestral sound.",
    "situationUsedInGame": "Plays during poignant moments reflecting Frieren’s long lifespan and enduring memories.",
    "youTubeLink": "https://www.youtube.com/watch?v=4kOWTy_5LmU"
  },
  {
    "songName": "Great Mage Flamme",
    "feel": "Mystical and awe-inspiring, with a deeply atmospheric, legendary tone.",
    "instrumentsUsed": "Haunting oboe melody, rich string orchestra, and soft ethereal choral voices.",
    "situationUsedInGame": "Theme for the ancient mage Flamme, heard during mystical revelations or when recalling her teachings.",
    "youTubeLink": "https://www.youtube.com/watch?v=WV096Y6uOrY"
  },
  {
    "songName": "New and Dangerous Magic",
    "feel": "Urgent and formidable, invoking a sense of peril and high stakes.",
    "instrumentsUsed": "Driving bagpipes, pounding percussion, and fierce wordless vocals for dramatic effect.",
    "situationUsedInGame": "Heard in tense confrontations with powerful spells or dangerous new foes.",
    "youTubeLink": "https://www.youtube.com/watch?v=zX5PU71KKWY"
  },
  {
    "songName": "A Beautiful Word",
    "feel": "Gentle and heartfelt, growing into an uplifting and emotional climax.",
    "instrumentsUsed": "Delicate piano and strings that build with brass and choir into a sweeping finale.",
    "situationUsedInGame": "Plays during touching moments of gratitude or understanding, highlighting a poignant revelation.",
    "youTubeLink": "https://www.youtube.com/watch?v=cbrGRQAF8R8"
  },
  {
    "songName": "The End of One Journey",
    "feel": "Bittersweet and reflective, marking the close of an era or adventure.",
    "instrumentsUsed": "Acoustic guitar and flute accompanied by soft, warm strings.",
    "situationUsedInGame": "Heard at the conclusion of a quest or chapter, underscoring an ending and a farewell.",
    "youTubeLink": "https://www.youtube.com/watch?v=Run4KxCLlGw"
  },
  {
    "songName": "A Well-Earned Celebration",
    "feel": "Bright and joyous, brimming with warm, festive cheer.",
    "instrumentsUsed": "Lively accordion and flutes backed by upbeat rhythmic percussion.",
    "situationUsedInGame": "Used during merry gatherings or festival scenes to celebrate victories and camaraderie.",
    "youTubeLink": "https://www.youtube.com/watch?v=uYFA4u2bfvY"
  }
]

