[
  {
    "songName": "Midna's Lament",
    "feel": "Somber and emotional, evoking sadness and urgency.",
    "instrumentsUsed": "Solo piano backed by soft strings.",
    "situationUsedInGame": "Plays during the sequence where Wolf Link rushes a dying Midna to Princess Zelda (urgent story event).",
    "youTubeLink": "https://youtu.be/P_kyCU0gwfA?si=am0cBQVOw0PUoBFu"
  },
  {
    "songName": "Hyrule Field Theme",
    "feel": "Grand and adventurous, embodying a heroic journey across the land.",
    "instrumentsUsed": "Full orchestra (triumphant brass, sweeping strings, and percussion).",
    "situationUsedInGame": "Overworld exploration music while traveling through Hyrule Field in daytime.",
    "youTubeLink": "https://www.youtube.com/watch?v=t6JgG__XbRA"
  },
  {
    "songName": "Dark Lord Ganondorf",
    "feel": "Intense and foreboding, building epic tension for the final battle.",
    "instrumentsUsed": "Powerful brass, fast-paced strings, heavy percussion, (final boss orchestral arrangement).",
    "situationUsedInGame": "Final boss fight theme during the climactic sword duel with Ganondorf at Hyrule Castle.",
    "youTubeLink": "https://www.youtube.com/watch?v=LDuhSdtvhUY"
  },
  {
    "songName": "Sacred Grove",
    "feel": "Mysterious and tranquil, with a slightly haunting undertone.",
    "instrumentsUsed": "Soft flute and harp accompanied by gentle ambient chimes.",
    "situationUsedInGame": "Background music in the Sacred Grove (Lost Woods ruins where the Master Sword is found).",
    "youTubeLink": "https://www.youtube.com/watch?v=nIionSi7iUM"
  },
  {
    "songName": "Queen Rutela's Theme",
    "feel": "Sorrowful and soothing, with a deeply haunting beauty.",
    "instrumentsUsed": "Ethereal choral vocals with gentle string accompaniment.",
    "situationUsedInGame": "Plays during scenes with the spirit of Queen Rutela (the Zora queen’s ghost aiding Link).",
    "youTubeLink": "https://www.youtube.com/watch?v=IUYio1pgono"
  },
  {
    "songName": "Midna's Theme",
    "feel": "Mysterious and reflective, hinting at both mischief and sadness.",
    "instrumentsUsed": "Soft woodwinds and twinkling chimes over a subtle string background.",
    "situationUsedInGame": "Used in cutscenes focusing on Midna (highlighting her presence and emotional moments).",
    "youTubeLink": "https://www.youtube.com/watch?v=VgRaBiwYew8"
  },
  {
    "songName": "Lake Hylia",
    "feel": "Peaceful and calm, evoking a sense of relaxation by the water.",
    "instrumentsUsed": "Gentle strings and woodwinds with soft ambient backing.",
    "situationUsedInGame": "Area background music for Lake Hylia during exploration and downtime.",
    "youTubeLink": "https://www.youtube.com/watch?v=Qcf5_OdJOL0"
  }
]

